---
kind: method
id: M:Autodesk.Revit.DB.DividedSurface.RemoveIntersectionElement(Autodesk.Revit.DB.ElementId)
source: html/c5098b67-9c5c-58f2-bfea-24174072e816.htm
---
# Autodesk.Revit.DB.DividedSurface.RemoveIntersectionElement Method

Removes an intersection element from a divided surface.

## Syntax (C#)
```csharp
public void RemoveIntersectionElement(
	ElementId referenceElemIdToRemove
)
```

## Parameters
- **referenceElemIdToRemove** (`Autodesk.Revit.DB.ElementId`) - The intersection element to be removed.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null